In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("titanic.csv")

In [3]:
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [4]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [5]:
input=data.drop('Survived',axis='columns')
target=data.Survived
input.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [6]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [7]:
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [8]:
#input.Sex=input.Sex.map({'male':1,'female':2})
#input.head()

In [9]:
dummies=pd.get_dummies(input.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [10]:
input=pd.concat([input,dummies],axis='columns')
input.head(10)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1
5       3    male   NaN   8.4583       0     1
6       1    male  54.0  51.8625       0     1
7       3    male   2.0  21.0750       0     1
8       3  female  27.0  11.1333       1     0
9       2  female  14.0  30.0708       1     0

### I have to drop Sex column as well as the male column for the dummy variable trap

In [11]:
input.drop(['Sex','male'],axis='columns',inplace=True)
input.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [12]:
input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [13]:
input.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [14]:
input.Age=input.Age.fillna(input.Age.mean())
input.Age[0:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [15]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(input,target,test_size=0.2)

In [16]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [17]:
model.fit(x_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [18]:
model.score(x_test,y_test)

0.8156424581005587

In [19]:
x_test[0:10]

     Pclass        Age     Fare  female
472       2  33.000000  27.7500       1
468       3  29.699118   7.7250       0
451       3  29.699118  19.9667       0
23        1  28.000000  35.5000       0
322       2  30.000000  12.3500       1
668       3  43.000000   8.0500       0
538       3  29.699118  14.5000       0
562       2  28.000000  13.5000       0
233       3   5.000000  31.3875       1
62        1  45.000000  83.4750       0

In [20]:
model.predict_proba(x_test[0:10])

array([[0.29583223, 0.70416777],
       [0.96507131, 0.03492869],
       [0.96503623, 0.03496377],
       [0.73747305, 0.26252695],
       [0.30771459, 0.69228541],
       [0.9641191 , 0.0358809 ],
       [0.96547627, 0.03452373],
       [0.92465672, 0.07534328],
       [0.35591768, 0.64408232],
       [0.37565667, 0.62434333]])

In [21]:
y_test[0:10]

472    1
468    0
451    0
23     1
322    1
668    0
538    0
562    0
233    1
62     0
Name: Survived, dtype: int64

In [22]:
model.predict(x_test[0:10])

array([1, 0, 0, 0, 1, 0, 0, 0, 1, 1], dtype=int64)